'use client';
const mockupdata = {
    title: "ทิศทางและนโยบายการดำเนินงานของผู้อำนวยการ สบร.",
    author: "ดร.ทวารัฐ สูตะบุตร",
    urlimgs: '/c1.png',
    sections: [
        {
            id: 1,
            detail: ["สำนักงานบริหารและพัฒนาองค์ความรู้ (องค์การมหาชน) หรือ OKMD มีบทบาทภารกิจสำคัญในการพัฒนา “พื้นที่เรียนรู้ต้นแบบ” ให้มีความทันสมัย เพื่อส่งเสริมกระบวนการเรียนรู้ ส่งเสริมการอ่าน รวมทั้งกระตุ้นความอยากรู้ และพัฒนาความคิดสร้างสรรค์ให้แก่ประชาชนทุกเพศ ทุกวัย เพื่อรองรับสังคมยุคใหม่ที่กำลังก้าวเข้าสู่ยุคศตวรรษที่ 21 ซึ่งเต็มไปด้วยเทคโนโลยีดิจิทัลและเป็นโลกที่ไร้พรมแดน "]
        },
        {
            id: 2,
            detail: ["โดยในปี พ.ศ. 2566 เป็นต้นไปนี้ สังคมไทยของเรากำลังจะก้าวเข้าสู่โลกที่เต็มไปด้วยกระบวนการเรียนรู้ผ่าน Digital Platform และ Social Media แบบเต็มรูปแบบ OKMD จึงมีความมุ่งมั่นตั้งใจที่จะพัฒนาให้เกิดแหล่งเรียนรู้บน แพลตฟอร์มออนไลน์และออนไซต์ เพื่อให้ประชาชนสามารถเลือกการเข้าถึงองค์ความรู้ต่างๆ ได้โดยสะดวกทั่วถึงและ ต้นทุนต่ำ ซึ่งจะเป็นอีกช่องทางหนึ่งในการลดความเหลื่อมล้ำในสังคมรวมทั้งก่อให้เกิดประโยชน์ต่อการพัฒนาศักยภาพ ของประชาชนในภาพรวม ให้ก้าวทันกับโลกยุคใหม่ที่มีการเปลี่ยนแปลงอย่างรวดเร็ว"]
        }
    ],
    sections2: [
        {
            id: 1,
            deatil: ["การ “กระตุกต่อมคิด กระตุ้นความอยากรู้” จะทำให้สังคมไทยสามารถก้าวสู่การเป็น “สังคมอุดมปัญญา” หรือ “Knowledge Society” จึงจะเป็นฐานสำคัญในการขับเคลื่อนเศรษฐกิจในโลกยุคใหม่ที่ไร้รอยต่อ และไม่มีพรมแดนแห่ง การเรียนรู้แลกเปลี่ยนอีกต่อไป พร้อมกันนี้ OKMD ยังมุ่งเน้นการขับเคลื่อนงานให้สอดคล้องตามยุทธศาสตร์ชาติระยะ 20 ปี (พ.ศ. 2560 - 2579) ยุทธศาสตร์ที่ 3 ด้านการพัฒนาและเสริมสร้างศักยภาพคนโดยการพัฒนาศักยภาพคนใน ทุกช่วงวัยและส่งเสริมการเรียนรู้อย่างต่อเนื่องตลอดชีวิต ซึ่งมีเป้าหมายในการดำเนินงานที่สำคัญ ดังนี้"]
        }
    ],
    sections3: "พัฒนา Knowledge Ecosystem หรือระบบการเรียนรู้สาธารณะรูปแบบใหม่ของประเทศ ซึ่งเป็นงานสำคัญที่เกี่ยวข้องกับการจัดระบบการเรียนรู้ออนไลน์และการพัฒนาเทคโนโลยีดิจิทัลเพื่อการเรียนรู้"
}

export default function Poclicy() {
    const data = mockupdata;
    return (
        <div className="container">
            <h1 className='text-3xl font-bold mb-10'>{data.title}</h1>
            <div>
                <div className="flex flex-col">
                    <img src={data.urlimgs} alt="" className='w-full h-full' />
                    <div className='flex justify-end mb-5'>
                        โดย: {data.author}
                    </div>
                </div>
                {data.sections.map((data) =>
                    <div key={data.id}>
                        {data.detail.map((text, idx) => (
                            <p key={idx} className="mb-2 text-[15px] leading-relaxed text-[#333]">
                                {text}
                            </p>
                        ))}
                    </div>
                )}
            </div>
            <hr />
            <div>
                {data.sections2.map((data) => (
                    <div key={data.id}>
                        {data.deatil.map((text, idx) => (
                            <p key={idx} className="mb-2 text-[15px] leading-relaxed text-[#333]">
                                {text}
                            </p>
                        ))}
                    </div>
                ))}
            </div>
        </div>
    )
}

